/*
 ============================================================================
 Name        : c24-1-main.c
 Author      : john
 Version     :
 Copyright   : Your copyright notice
 Description : Hello World in C, Ansi-style
 ============================================================================
 */

 /* ヘッダファイル ------------------------------------------------------- */
#include <stdio.h>
/* 記号定数 ------------------------------------------------------------- */
#define SIZE 5
/* プロトタイプ宣言 ----------------------------------------------------- */
void Putarray(const int *p, int size);
/* エントリポイント ----------------------------------------------------- */
int main(void) {
int data[SIZE] = { 10, 8, 15, 4, 6 };
printf("配列内容\n"); Putarray(data, SIZE); //配列の内容を表示
return 0; }
/* ---------------------------------------------------------------------- */ /* 関数名:Putarray */
/* 機 能:int 型配列の内容を画面に表示する */
/* 戻り値:なし */
/* 引 数:const int *p :配列の先頭番地 */
/* int size :配列の要素数 */ /* ---------------------------------------------------------------------- */
void Putarray(const int *p, int size) {
int i;
for ( i = 0 ; i < size ; i++, p++ ) {
printf("Array[%d]=%d\n", i, *p); } }
