/*
 ============================================================================
 Name        : c21-2-main.c
 Author      : john
 Version     :
 Copyright   : Your copyright notice
 Description : Hello World in C, Ansi-style
 ============================================================================
 */

 /* ヘッダファイル -------------------------------------------------------- */
#include <stdio.h>
#include "c21-2-m1.h"

/* プロトタイプ宣言 ------------------------------------------------------ */
void Sub(void);
/* 外部変数 -------------------------------------------------------------- */
extern int glb1; // 外部変数参照宣言(これ以降の関数で「glb1」に
// アクセス可能)
/* main 関数 エントリポイント -------------------------------------------- */
int main(void) {
// 外部で参照宣言されているので「glb1」にアクセス可能
glb1 = 100;
printf("main:glb1:%d\n", glb1);
// 公開されている関数を利用して他のモジュールの外部変数に
// アクセス可能
Set_Value(300);
printf("main:Get_Value:%d\n", Get_Value());
Sub();
return 0;
}
/* Sub 関数 -------------------------------------------------------------- */
void Sub(void) {
extern int glb2; // 外部変数参照宣言(Sub 関数の中で「glb2」に
// アクセス可能)
glb2 = 200;
printf("Sub:glb2:%d\n", glb2);
printf("Sub:glb1:%d\n", glb1);
printf("Sub:Get_Value:%d\n", Get_Value());

}

