/*
 ============================================================================
 Name        : c18-2.c
 Author      : john
 Version     :
 Copyright   : Your copyright notice
 Description : Hello World in C, Ansi-style
 ============================================================================
 */

#include <stdio.h>
#include <stdlib.h>

#include <stdio.h>
/* プロトタイプ宣言------------------------------------------------------- */
char To_Upper(char ch);
/* エントリポイント To_Upper 関数の動作チェック-------------------------- */
int main(void) {
char c1 = 'a', c2 = 'B', c3 = 'c';
printf("変換前:%c%c%c\n", c1, c2, c3);
c1 = To_Upper(c1); c2 = To_Upper(c2); c3 = To_Upper(c3);
printf("変換後:%c%c%c\n", c1, c2, c3);
return 0; }
/* ----------------------------------------------------------------------- */ /*
 *  関数名:To_Upper */
/* 機 能:英小文字 → 英大文字 */
/* 戻り値:変換された文字(char 型) */ /*
 * ※引数が英小文字でない場合は,受け取ったそのままの文字 */
/* 引 数:ch : 半角文字(char 型) */
/* ----------------------------------------------------------------------- */
char To_Upper(char ch) {
if ( 'a' <= ch && ch <= 'z' ) {
ch -= 0x20; /* 英小文字 → 英大文字 */ }
return ch;
}
