/*
 * c22-1-sum.c
 *
 *  Created on: May 3, 2017
 *      Author: kagaya
 */

 /* ヘッダファイル -------------------------------------------------------- */
#include <stdio.h>
#include "c22-1-sum.h"
/* プロトタイプ宣言 ------------------------------------------------------ */
static void Put_Msg(int num);
/* 外部変数 -------------------------------------------------------------- */
static int sum; // データの合計値
static int cnt; // データの個数
/* Init_Sum 関数 ---------------------------------------------------------- */
void Init_Sum(void) {
sum = 0; // 合計値の 0(ゼロ)クリア
cnt = 0; // データ数の 0(ゼロ)クリア
}
/* Add_Data 関数 ---------------------------------------------------------- */
void Add_Data(int num) {
Put_Msg(num);
sum += num; // データの足し込み(合計)
cnt++; // データ数のカウント
}
/* Get_Sum 関数 ----------------------------------------------------------- */
int Get_Sum(void) {
return sum;
}
/* Get_Cnt 関数 ----------------------------------------------------------- */
int Get_Cnt(void) {
return cnt;
}
/* Put_Msg 関数 ----------------------------------------------------------- */
static void Put_Msg(int num){
printf("「%d」を追加しました.\n", num);
}

